open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rptun.c
/****************************************************************************
 * chips/bk7258/common/
 * bk7258_rptun.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * BK7258 CP/AP NuttX RPTUN lower half.  The Beken SDK mailbox-channel
 * wrapper supplies edge notifications; shared SRAM pending words retain the
 * delivery truth if an edge is coalesced or the hardware FIFO is busy.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_RPTUN

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <inttypes.h>
#include <stdio.h>
#include <string.h>
#include <errno.h>

#include <nuttx/nuttx.h>
#include <nuttx/rpmsg/rpmsg.h>
#include <nuttx/rptun/rptun.h>
#include <nuttx/signal.h>

#include <arch/chip/bk7258_amp.h>
#include <arch/chip/bk7258_ota_rpmsg.h>
#include <arch/chip/bk7258_rptun.h>
#ifdef CONFIG_BK7258_USBMODE_RPMSG
#  include <arch/chip/bk7258_usbmode_rpmsg.h>
#endif

#include "bk7258_rptun.h"
#ifdef CONFIG_BK7258_AP_SUPERVISOR
#  include "bk7258_rpmsg_health.h"
#endif
#include "bk7258_rptun_mbox.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifdef CONFIG_BK7258_AP_CORE
#  define BK7258_RPTUN_REMOTE_NAME "cp"
#else
#  define BK7258_RPTUN_REMOTE_NAME "ap"
#endif

#define BK7258_RPTUN_FEATURES \
  ((1u << VIRTIO_RPMSG_F_NS) | (1u << VIRTIO_RPMSG_F_ACK) | \
   (1u << VIRTIO_RPMSG_F_BUFSZ) | (1u << VIRTIO_RPMSG_F_CPUNAME))

#define BK7258_RPTUN_NOTIFY_VALID \
  (BK7258_RPTUN_NOTIFY_VRING0 | BK7258_RPTUN_NOTIFY_VRING1 | \
   BK7258_RPTUN_NOTIFY_ALL)

#define BK7258_RPTUN_PROOF_NAME_PREFIX "bk7258-rptun-"
#define BK7258_RPTUN_PROOF_NAME_SIZE \
  (sizeof(BK7258_RPTUN_PROOF_NAME_PREFIX) + 8u)

static_assert(BK7258_RPTUN_PROOF_NAME_SIZE <= RPMSG_NAME_SIZE,
              "RPTUN proof endpoint name exceeds the RPMsg ABI");

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bk7258_rptun_dev_s
{
  struct rptun_dev_s rptun;
  struct rpmsg_endpoint proof_ept;
  rptun_callback_t callback;
  void *callback_arg;
  char proof_name[RPMSG_NAME_SIZE];
  uint32_t generation;
  uint32_t proof_generation;
  bool bootstrap;
  bool proof_registered;
  bool initialized;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static const char *bk7258_rptun_get_cpuname(struct rptun_dev_s *dev);
static struct resource_table *
bk7258_rptun_get_resource(struct rptun_dev_s *dev);
static bool bk7258_rptun_is_autostart(struct rptun_dev_s *dev);
static bool bk7258_rptun_is_master(struct rptun_dev_s *dev);
static int bk7258_rptun_config(struct rptun_dev_s *dev, void *data);
static int bk7258_rptun_start(struct rptun_dev_s *dev);
static int bk7258_rptun_stop(struct rptun_dev_s *dev);
static int bk7258_rptun_notify(struct rptun_dev_s *dev, uint32_t vqid);
static int bk7258_rptun_register_callback(struct rptun_dev_s *dev,
                                          rptun_callback_t callback,
                                          void *arg);
static void bk7258_rptun_proof_device_created(
  struct rpmsg_device *rdev, void *arg);
static void bk7258_rptun_proof_device_destroyed(
  struct rpmsg_device *rdev, void *arg);
#ifndef CONFIG_BK7258_AP_CORE
static bool bk7258_rptun_proof_ns_match(struct rpmsg_device *rdev,
                                        void *arg, const char *name,
                                        uint32_t dest);
static void bk7258_rptun_proof_ns_bind(struct rpmsg_device *rdev,
                                       void *arg, const char *name,
                                       uint32_t dest);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct rptun_ops_s g_bk7258_rptun_ops =
{
  .get_cpuname       = bk7258_rptun_get_cpuname,
  .get_resource      = bk7258_rptun_get_resource,
  .is_autostart      = bk7258_rptun_is_autostart,
  .is_master         = bk7258_rptun_is_master,
  .config            = bk7258_rptun_config,
  .start             = bk7258_rptun_start,
  .stop              = bk7258_rptun_stop,
  .notify            = bk7258_rptun_notify,
  .register_callback = bk7258_rptun_register_callback,
};

static struct bk7258_rptun_dev_s g_bk7258_rptun;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static volatile uint32_t *bk7258_rptun_outgoing_pending(
  volatile struct bk7258_rptun_control_s *control)
{
#ifdef CONFIG_BK7258_AP_CORE
  return &control->ap_to_cp_pending;
#else
  return &control->cp_to_ap_pending;
#endif
}

static volatile uint32_t *bk7258_rptun_incoming_pending(
  volatile struct bk7258_rptun_control_s *control)
{
#ifdef CONFIG_BK7258_AP_CORE
  return &control->cp_to_ap_pending;
#else
  return &control->ap_to_cp_pending;
#endif
}

static volatile uint32_t *bk7258_rptun_local_rx_sequence(
  volatile struct bk7258_rptun_control_s *control)
{
#ifdef CONFIG_BK7258_AP_CORE
  return &control->ap_rx_sequence;
#else
  return &control->cp_rx_sequence;
#endif
}

static uint32_t bk7258_rptun_vqid_mask(uint32_t vqid)
{
  if (vqid == RPTUN_NOTIFY_ALL || vqid >= 31u)
    {
      return BK7258_RPTUN_NOTIFY_ALL;
    }

  return 1u << vqid;
}

static bool bk7258_rptun_proof_generation_valid(
  struct bk7258_rptun_dev_s *priv)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  uint32_t generation;

  if (!__atomic_load_n(&priv->initialized, __ATOMIC_ACQUIRE))
    {
      return false;
    }

  generation = __atomic_load_n(&priv->generation, __ATOMIC_ACQUIRE);
  __asm volatile ("dmb sy" ::: "memory");
  return generation != 0 && control->generation == generation;
}

/* This endpoint is transport infrastructure, not a test or supervisor
 * service.  The AP announces a generation-qualified name, the CP binds it
 * with a known destination (which makes OpenAMP send NS_CREATE_ACK), and the
 * AP's ns_bound callback observes that ACK.  Each core therefore stops its
 * local bootstrap scan only after its own RPMsg device completed probing.
 * Keep the endpoint until device_destroy so NuttX owns the normal remove and
 * restart ordering.
 */

