open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rptun.c
static bool bk7258_rptun_proof_device_matches(struct rpmsg_device *rdev)
{
  const char *cpuname = rpmsg_get_cpuname(rdev);

  return cpuname != NULL &&
         strcmp(cpuname, BK7258_RPTUN_REMOTE_NAME) == 0;
}

static void bk7258_rptun_proof_fail(struct bk7258_rptun_dev_s *priv,
                                    int error)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  uint32_t expected = BK7258_RPTUN_STATE_CONNECTING;

  if (error >= 0 || !bk7258_rptun_proof_generation_valid(priv))
    {
      return;
    }

  if (__atomic_compare_exchange_n(
        (uint32_t *)(uintptr_t)&control->state, &expected,
        BK7258_RPTUN_STATE_FAULTED, false,
        __ATOMIC_ACQ_REL, __ATOMIC_RELAXED))
    {
      control->error = (uint32_t)-error;
      __asm volatile ("dmb sy" ::: "memory");
    }
}

static int bk7258_rptun_proof_ept_cb(struct rpmsg_endpoint *ept,
                                     void *data, size_t len,
                                     uint32_t src, void *arg)
{
  (void)ept;
  (void)data;
  (void)len;
  (void)src;
  (void)arg;

  /* The proof is completed by Name Service CREATE/ACK and carries no data.
   * Ignore an unexpected payload without violating the RPMsg callback
   * contract or perturbing the transport lifecycle.
   */

  return OK;
}

#ifdef CONFIG_BK7258_AP_CORE
static void bk7258_rptun_proof_ns_bound(struct rpmsg_endpoint *ept)
{
  struct bk7258_rptun_dev_s *priv = ept->priv;
  uint32_t generation;

  if (priv == NULL || ept != &priv->proof_ept ||
      !bk7258_rptun_proof_generation_valid(priv) ||
      !is_rpmsg_ept_ready(ept) ||
      strcmp(ept->name, priv->proof_name) != 0)
    {
      return;
    }

  generation = __atomic_load_n(&priv->generation, __ATOMIC_ACQUIRE);
  if (__atomic_load_n(&priv->proof_generation, __ATOMIC_ACQUIRE) !=
      generation)
    {
      return;
    }

  bk7258_rptun_mark_connected();
}
#endif

static void bk7258_rptun_proof_device_created(
  struct rpmsg_device *rdev, void *arg)
{
  struct bk7258_rptun_dev_s *priv = arg;
#ifdef CONFIG_BK7258_AP_CORE
  int ret;
#endif

  if (!bk7258_rptun_proof_device_matches(rdev))
    {
      return;
    }

  if (!rdev->support_ns || !rdev->support_ack)
    {
      bk7258_rptun_proof_fail(priv, -EPROTONOSUPPORT);
      return;
    }

#ifdef CONFIG_BK7258_AP_CORE
  if (!bk7258_rptun_proof_generation_valid(priv))
    {
      return;
    }

  if (priv->proof_ept.rdev != NULL)
    {
      bk7258_rptun_proof_fail(priv, -EBUSY);
      return;
    }

  priv->proof_ept.priv = priv;
  priv->proof_ept.ns_bound_cb = bk7258_rptun_proof_ns_bound;
  __atomic_store_n(&priv->proof_generation, priv->generation,
                   __ATOMIC_RELEASE);
  ret = rpmsg_create_ept(&priv->proof_ept, rdev, priv->proof_name,
                         RPMSG_ADDR_ANY, RPMSG_ADDR_ANY,
                         bk7258_rptun_proof_ept_cb, NULL);
  if (ret < 0)
    {
      __atomic_store_n(&priv->proof_generation, 0, __ATOMIC_RELEASE);
      memset(&priv->proof_ept, 0, sizeof(priv->proof_ept));
      bk7258_rptun_proof_fail(priv, ret);
    }
#endif
}

#ifndef CONFIG_BK7258_AP_CORE
static bool bk7258_rptun_proof_ns_match(struct rpmsg_device *rdev,
                                        void *arg, const char *name,
                                        uint32_t dest)
{
  struct bk7258_rptun_dev_s *priv = arg;

  (void)dest;
  return bk7258_rptun_proof_device_matches(rdev) &&
         rdev->support_ns && rdev->support_ack &&
         bk7258_rptun_proof_generation_valid(priv) &&
         strcmp(name, priv->proof_name) == 0;
}

static void bk7258_rptun_proof_ns_bind(struct rpmsg_device *rdev,
                                       void *arg, const char *name,
                                       uint32_t dest)
{
  struct bk7258_rptun_dev_s *priv = arg;
  int ret;

  if (!bk7258_rptun_proof_ns_match(rdev, arg, name, dest))
    {
      return;
    }

  if (priv->proof_ept.rdev != NULL)
    {
      bk7258_rptun_proof_fail(priv, -EBUSY);
      return;
    }

  priv->proof_ept.priv = priv;
  __atomic_store_n(&priv->proof_generation, priv->generation,
                   __ATOMIC_RELEASE);
  ret = rpmsg_create_ept(&priv->proof_ept, rdev, name,
                         RPMSG_ADDR_ANY, dest,
                         bk7258_rptun_proof_ept_cb, NULL);
  if (ret < 0)
    {
      __atomic_store_n(&priv->proof_generation, 0, __ATOMIC_RELEASE);
      memset(&priv->proof_ept, 0, sizeof(priv->proof_ept));
      bk7258_rptun_proof_fail(priv, ret);
      return;
    }

  if (bk7258_rptun_proof_generation_valid(priv) &&
      __atomic_load_n(&priv->proof_generation, __ATOMIC_ACQUIRE) ==
      priv->generation)
    {
      bk7258_rptun_mark_connected();
    }
}
#endif

static void bk7258_rptun_proof_device_destroyed(
  struct rpmsg_device *rdev, void *arg)
{
  struct bk7258_rptun_dev_s *priv = arg;

  if (!bk7258_rptun_proof_device_matches(rdev) ||
      priv->proof_ept.rdev != rdev)
    {
      return;
    }

  __atomic_store_n(&priv->proof_generation, 0, __ATOMIC_RELEASE);
  rpmsg_destroy_ept(&priv->proof_ept);
  memset(&priv->proof_ept, 0, sizeof(priv->proof_ept));
}

static int bk7258_rptun_proof_register(struct bk7258_rptun_dev_s *priv)
{
  int ret;

  ret = rpmsg_register_callback(priv,
                                bk7258_rptun_proof_device_created,
                                bk7258_rptun_proof_device_destroyed,
#ifdef CONFIG_BK7258_AP_CORE
                                NULL, NULL);
#else
                                bk7258_rptun_proof_ns_match,
                                bk7258_rptun_proof_ns_bind);
#endif
  if (ret >= 0)
    {
      priv->proof_registered = true;
    }

  return ret;
}

static void bk7258_rptun_proof_unregister(
  struct bk7258_rptun_dev_s *priv)
{
  if (!priv->proof_registered)
    {
      return;
    }

  rpmsg_unregister_callback(priv,
                            bk7258_rptun_proof_device_created,
                            bk7258_rptun_proof_device_destroyed,
#ifdef CONFIG_BK7258_AP_CORE
                            NULL, NULL);
#else
                            bk7258_rptun_proof_ns_match,
                            bk7258_rptun_proof_ns_bind);
#endif
  priv->proof_registered = false;
}

static void bk7258_rptun_receive(uint32_t generation, uint32_t notify)
{
  struct bk7258_rptun_dev_s *priv = &g_bk7258_rptun;
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  volatile uint32_t *incoming = bk7258_rptun_incoming_pending(control);
  volatile uint32_t *outgoing = bk7258_rptun_outgoing_pending(control);
  rptun_callback_t callback;
  uint32_t pending;
  bool bootstrap;

  if (!priv->initialized || generation != priv->generation)
    {
      return;
    }

