open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rptun.c
  /* Registration follows rptun_initialize() asynchronously.  Keep the
   * level-triggered shared pending bits intact until OpenAMP has installed
   * its callback; consuming them first loses the initial virtio handshake
   * permanently when the mailbox worker wins that startup race.
   */

  callback = priv->callback;
  if (callback == NULL)
    {
      return;
    }

  pending = __atomic_exchange_n((uint32_t *)(uintptr_t)incoming, 0,
                                __ATOMIC_ACQ_REL);
  bootstrap = __atomic_load_n(&priv->bootstrap, __ATOMIC_ACQUIRE);
  __asm volatile ("dmb sy" ::: "memory");
  pending |= notify & BK7258_RPTUN_NOTIFY_VALID;
  if ((pending & BK7258_RPTUN_NOTIFY_VALID) != 0)
    {
      __atomic_fetch_add(
        (uint32_t *)(uintptr_t)bk7258_rptun_local_rx_sequence(control),
        1u, __ATOMIC_RELEASE);
    }

  /* RPTUN installs the lower-half callback after remoteproc_start(), but
   * creates the virtio devices immediately afterwards in another step.
   * remoteproc_get_notification() returns success when its vdev list is
   * still empty, so an early edge cannot be acknowledged reliably.  Keep a
   * local bootstrap level until this core's Name Service callback proves its
   * RPMsg device exists.  Do not gate this rescan on the shared lifecycle
   * state: it is peer-owned during part of startup and may be cache-stale.
   */

  if ((pending & BK7258_RPTUN_NOTIFY_ALL) != 0 ||
      bootstrap)
    {
      callback(priv->callback_arg, RPTUN_NOTIFY_ALL);
    }
  else
    {
      if ((pending & BK7258_RPTUN_NOTIFY_VRING0) != 0)
        {
          callback(priv->callback_arg, 0);
        }

      if ((pending & BK7258_RPTUN_NOTIFY_VRING1) != 0)
        {
          callback(priv->callback_arg, 1);
        }
    }

  /* A peer pulse is also an opportunity to repair an edge that was queued
   * while the SDK's one-deep logical channel was busy.
   */

  pending = __atomic_load_n((uint32_t *)(uintptr_t)outgoing,
                            __ATOMIC_ACQUIRE);
  if (pending != 0)
    {
      (void)bk7258_rptun_mbox_notify(generation, pending);
    }
}

#ifndef CONFIG_BK7258_AP_CORE
static void bk7258_rptun_prepare_resource(uint32_t generation)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  struct rptun_rsc_s *rsc =
    (struct rptun_rsc_s *)(uintptr_t)BK7258_RPTUN_RESOURCE_ADDR;

  memset(rsc, 0, sizeof(*rsc));

  rsc->rsc_tbl_hdr.ver = 1;
  rsc->rsc_tbl_hdr.num = 2;
  rsc->offset[0] = offsetof(struct rptun_rsc_s, rpmsg_vdev);
  rsc->offset[1] = offsetof(struct rptun_rsc_s, carveout);

  rsc->rpmsg_vdev.type = RSC_VDEV;
  rsc->rpmsg_vdev.id = VIRTIO_ID_RPMSG;
  rsc->rpmsg_vdev.dfeatures = BK7258_RPTUN_FEATURES;
  rsc->rpmsg_vdev.config_len = sizeof(struct fw_rsc_config);
  rsc->rpmsg_vdev.num_of_vrings = BK7258_RPTUN_VRING_COUNT;

  /* RPTUN XORs is_master() with whether this field is DRIVER.  Marking the
   * table's native role as DRIVER therefore makes the CP master the virtio
   * driver and the AP remote the virtio device.
   */

  rsc->rpmsg_vdev.reserved[0] = VIRTIO_DEV_DRIVER;

  rsc->rpmsg_vring0.da = FW_RSC_U32_ADDR_ANY;
  rsc->rpmsg_vring0.align = BK7258_RPTUN_VRING_ALIGN;
  rsc->rpmsg_vring0.num = BK7258_RPTUN_VRING_NUM;
  rsc->rpmsg_vring0.notifyid = 0;
  rsc->rpmsg_vring1.da = FW_RSC_U32_ADDR_ANY;
  rsc->rpmsg_vring1.align = BK7258_RPTUN_VRING_ALIGN;
  rsc->rpmsg_vring1.num = BK7258_RPTUN_VRING_NUM;
  rsc->rpmsg_vring1.notifyid = 1;
  rsc->config.r2h_buf_size = BK7258_RPTUN_BUFFER_SIZE;
  rsc->config.h2r_buf_size = BK7258_RPTUN_BUFFER_SIZE;
  memcpy(rsc->config.host_cpuname, "cp", sizeof("cp"));
  memcpy(rsc->config.remote_cpuname, "ap", sizeof("ap"));

  rsc->carveout.type = RSC_CARVEOUT;
  rsc->carveout.da = BK7258_RPTUN_CARVEOUT_ADDR;
  rsc->carveout.pa = FW_RSC_U32_ADDR_ANY;
  rsc->carveout.len = BK7258_RPTUN_CARVEOUT_SIZE;
  memcpy(rsc->carveout.name, "rpmsg_shm", sizeof("rpmsg_shm"));

  control->generation = generation;
  control->resource_crc32 = 0;
  control->cp_to_ap_pending = 0;
  control->ap_to_cp_pending = 0;
  control->cp_rx_sequence = 0;
  control->ap_rx_sequence = 0;
  __asm volatile ("dmb sy" ::: "memory");
  control->state = BK7258_RPTUN_STATE_TABLE_READY;
  __asm volatile ("dmb sy; sev" ::: "memory");
}
#endif

static const char *bk7258_rptun_get_cpuname(struct rptun_dev_s *dev)
{
  (void)dev;
  return BK7258_RPTUN_REMOTE_NAME;
}

static struct resource_table *
bk7258_rptun_get_resource(struct rptun_dev_s *dev)
{
  struct bk7258_rptun_dev_s *priv =
    container_of(dev, struct bk7258_rptun_dev_s, rptun);

#ifdef CONFIG_BK7258_AP_CORE
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  int timeout = CONFIG_RPTUN_STATUS_TIMEOUT_MS;

  while (timeout-- > 0)
    {
      __asm volatile ("dmb sy" ::: "memory");
      if (control->magic == BK7258_RPTUN_CONTROL_MAGIC &&
          control->version == BK7258_RPTUN_CONTROL_VERSION &&
          control->size == sizeof(*control) &&
          control->generation == priv->generation &&
          control->state >= BK7258_RPTUN_STATE_TABLE_READY &&
          control->state < BK7258_RPTUN_STATE_QUIESCING)
        {
          break;
        }

      nxsig_usleep(1000);
    }

  if (timeout < 0)
    {
      return NULL;
    }
#else
  (void)priv;
#endif

  return (struct resource_table *)(uintptr_t)BK7258_RPTUN_RESOURCE_ADDR;
}

static bool bk7258_rptun_is_autostart(struct rptun_dev_s *dev)
{
  (void)dev;
  return true;
}

static bool bk7258_rptun_is_master(struct rptun_dev_s *dev)
{
  (void)dev;
#ifdef CONFIG_BK7258_AP_CORE
  return false;
#else
  return true;
#endif
}

static int bk7258_rptun_config(struct rptun_dev_s *dev, void *data)
{
  (void)dev;
  (void)data;
  return OK;
}

static int bk7258_rptun_start(struct rptun_dev_s *dev)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();

  (void)dev;
  __asm volatile ("dmb sy" ::: "memory");
  if (control->state == BK7258_RPTUN_STATE_TABLE_READY)
    {
      control->state = BK7258_RPTUN_STATE_CONNECTING;
      __asm volatile ("dmb sy" ::: "memory");
    }

  return OK;
}

static int bk7258_rptun_stop(struct rptun_dev_s *dev)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();

  (void)dev;
  control->state = BK7258_RPTUN_STATE_QUIESCING;
  __asm volatile ("dmb sy" ::: "memory");
  return OK;
}

