open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rptun.c
static int bk7258_rptun_notify(struct rptun_dev_s *dev, uint32_t vqid)
{
  struct bk7258_rptun_dev_s *priv =
    container_of(dev, struct bk7258_rptun_dev_s, rptun);
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  volatile uint32_t *outgoing = bk7258_rptun_outgoing_pending(control);
  uint32_t mask = bk7258_rptun_vqid_mask(vqid);

  __atomic_fetch_or((uint32_t *)(uintptr_t)outgoing, mask,
                    __ATOMIC_RELEASE);
  __asm volatile ("dmb sy" ::: "memory");
  return bk7258_rptun_mbox_notify(priv->generation, mask);
}

static int bk7258_rptun_register_callback(struct rptun_dev_s *dev,
                                          rptun_callback_t callback,
                                          void *arg)
{
  struct bk7258_rptun_dev_s *priv =
    container_of(dev, struct bk7258_rptun_dev_s, rptun);

  priv->callback_arg = arg;
  __atomic_store_n(&priv->bootstrap, callback != NULL, __ATOMIC_RELEASE);
  __asm volatile ("dmb sy" ::: "memory");
  priv->callback = callback;
  __asm volatile ("dmb sy" ::: "memory");
  bk7258_rptun_mbox_set_notify(callback != NULL ?
                              bk7258_rptun_receive : NULL);
  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

void bk7258_rptun_mark_connected(void)
{
  struct bk7258_rptun_dev_s *priv = &g_bk7258_rptun;
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  uint32_t expected = BK7258_RPTUN_STATE_CONNECTING;
  bool connected;

  /* Name Service binding is the first bidirectional proof that the remote
   * RPMsg stack consumed the shared table.  Do not overwrite a concurrent
   * lifecycle transition such as QUIESCING or FAULTED.
   */

  /* This callback is local proof that rptun_create_devices() completed.
   * Stop the periodic all-vring bootstrap scan on this core regardless of
   * which core won the shared CONNECTING -> CONNECTED transition.
   */

  if (!bk7258_rptun_proof_generation_valid(priv))
    {
      return;
    }

  __atomic_store_n(&priv->bootstrap, false, __ATOMIC_RELEASE);
  connected = __atomic_compare_exchange_n(
                (uint32_t *)(uintptr_t)&control->state, &expected,
                BK7258_RPTUN_STATE_CONNECTED, false,
                __ATOMIC_RELEASE, __ATOMIC_RELAXED);
  if (connected || expected == BK7258_RPTUN_STATE_CONNECTED)
    {
      /* Preserve proof that the vdev completed its asynchronous probe even
       * if the supervisor subsequently changes CONNECTED to FAULTED.  A
       * FAULTED instance that never reached this point is not safe to remove
       * with the pinned NuttX RPTUN implementation.
       */

      __atomic_fetch_or((uint32_t *)(uintptr_t)&control->flags,
                        BK7258_RPTUN_FLAG_CONNECTED_ONCE,
                        __ATOMIC_RELEASE);
    }
}

int bk7258_rptun_initialize(uint32_t generation)
{
  struct bk7258_rptun_dev_s *priv = &g_bk7258_rptun;
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  int ret;

  if (generation == 0)
    {
      return -EINVAL;
    }

  if (priv->initialized)
    {
      if (priv->generation == generation)
        {
          return OK;
        }

#ifdef CONFIG_BK7258_AP_CORE
      return -ESTALE;
#else
      /* The CP keeps its registered RPTUN lower half across an AP reset.
       * Rebuild the shared table for the new generation, then restart the
       * existing NuttX RPTUN instance.  The lifecycle owner quiesces it
       * before clearing shared SRAM, so no old worker can observe this table.
       */

      __atomic_store_n(&priv->generation, generation, __ATOMIC_RELEASE);
      __atomic_store_n(&priv->proof_generation, 0, __ATOMIC_RELEASE);
      snprintf(priv->proof_name, sizeof(priv->proof_name), "%s%08" PRIx32,
               BK7258_RPTUN_PROOF_NAME_PREFIX, generation);
      bk7258_rptun_prepare_resource(generation);
      ret = rptun_boot(BK7258_RPTUN_REMOTE_NAME);
      if (ret < 0)
        {
          control->error = (uint32_t)-ret;
          control->state = BK7258_RPTUN_STATE_FAULTED;
          __asm volatile ("dmb sy" ::: "memory");
        }

      return ret;
#endif
    }

#ifndef CONFIG_BK7258_AP_CORE
  bk7258_rptun_prepare_resource(generation);
#else
  __asm volatile ("dmb sy" ::: "memory");
  if (control->magic != BK7258_RPTUN_CONTROL_MAGIC ||
      control->version != BK7258_RPTUN_CONTROL_VERSION ||
      control->size != sizeof(*control) ||
      control->generation != generation)
    {
      return -EPROTO;
    }
#endif

  memset(priv, 0, sizeof(*priv));
  priv->rptun.ops = &g_bk7258_rptun_ops;
  __atomic_store_n(&priv->generation, generation, __ATOMIC_RELEASE);
  snprintf(priv->proof_name, sizeof(priv->proof_name), "%s%08" PRIx32,
           BK7258_RPTUN_PROOF_NAME_PREFIX, generation);
  __atomic_store_n(&priv->initialized, true, __ATOMIC_RELEASE);

  ret = bk7258_rptun_proof_register(priv);
  if (ret < 0)
    {
      __atomic_store_n(&priv->initialized, false, __ATOMIC_RELEASE);
      control->error = (uint32_t)-ret;
      control->state = BK7258_RPTUN_STATE_FAULTED;
      __asm volatile ("dmb sy" ::: "memory");
      return ret;
    }

#ifdef CONFIG_BK7258_AP_SUPERVISOR
  /* Register the board health service before creating the RPTUN device.
   * rpmsg_register_callback() also handles already-created devices, but this
   * order keeps an allocation failure from leaving a partially initialized
   * RPTUN instance that cannot be unregistered by this NuttX version.
   */

  ret = bk7258_rpmsg_health_initialize();
  if (ret < 0)
    {
      bk7258_rptun_proof_unregister(priv);
      __atomic_store_n(&priv->initialized, false, __ATOMIC_RELEASE);
      control->error = (uint32_t)-ret;
      control->state = BK7258_RPTUN_STATE_FAULTED;
      __asm volatile ("dmb sy" ::: "memory");
      return ret;
    }
#endif

#ifdef CONFIG_BK7258_OTA_RPMSG
  ret = bk7258_ota_rpmsg_initialize();
  if (ret < 0)
    {
      bk7258_rptun_proof_unregister(priv);
      __atomic_store_n(&priv->initialized, false, __ATOMIC_RELEASE);
      control->error = (uint32_t)-ret;
      control->state = BK7258_RPTUN_STATE_FAULTED;
      __asm volatile ("dmb sy" ::: "memory");
      return ret;
    }
#endif

