open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rptun.c
#ifdef CONFIG_BK7258_USBMODE_RPMSG
  ret = bk7258_usbmode_rpmsg_initialize();
  if (ret < 0)
    {
      bk7258_rptun_proof_unregister(priv);
      __atomic_store_n(&priv->initialized, false, __ATOMIC_RELEASE);
      control->error = (uint32_t)-ret;
      control->state = BK7258_RPTUN_STATE_FAULTED;
      __asm volatile ("dmb sy" ::: "memory");
      return ret;
    }
#endif

  ret = rptun_initialize(&priv->rptun);
  if (ret < 0)
    {
      bk7258_rptun_proof_unregister(priv);
      __atomic_store_n(&priv->initialized, false, __ATOMIC_RELEASE);
      control->error = (uint32_t)-ret;
      control->state = BK7258_RPTUN_STATE_FAULTED;
      __asm volatile ("dmb sy" ::: "memory");
      return ret;
    }

#ifdef CONFIG_BK7258_AP_CORE
  __atomic_fetch_or((uint32_t *)(uintptr_t)&control->flags,
                    BK7258_RPTUN_FLAG_AP_CORE_READY, __ATOMIC_RELEASE);
#endif

#ifdef CONFIG_BK7258_RPMSG_TEST
#ifdef CONFIG_BK7258_AP_CORE
  __atomic_fetch_or((uint32_t *)(uintptr_t)&control->flags,
                    BK7258_RPTUN_FLAG_AP_TEST_ENTER, __ATOMIC_RELEASE);
#endif
  ret = bk7258_rpmsg_test_initialize();
  if (ret < 0)
    {
      control->error = (uint32_t)-ret;
      control->state = BK7258_RPTUN_STATE_FAULTED;
      __asm volatile ("dmb sy" ::: "memory");
      return ret;
    }

#ifdef CONFIG_BK7258_AP_CORE
  __atomic_fetch_or((uint32_t *)(uintptr_t)&control->flags,
                    BK7258_RPTUN_FLAG_AP_TEST_READY, __ATOMIC_RELEASE);
#endif
#endif

#ifdef CONFIG_BK7258_RPMSGFS_TEST
  ret = bk7258_rpmsgfs_test_initialize();
  if (ret < 0)
    {
      control->error = (uint32_t)-ret;
      control->state = BK7258_RPTUN_STATE_FAULTED;
      __asm volatile ("dmb sy" ::: "memory");
      return ret;
    }
#endif

#ifdef CONFIG_BK7258_BT_IPC_TEST
  ret = bk7258_bt_test_initialize();
  if (ret < 0)
    {
      control->error = (uint32_t)-ret;
      control->state = BK7258_RPTUN_STATE_FAULTED;
      __asm volatile ("dmb sy" ::: "memory");
      return ret;
    }
#endif

  return OK;
}

int bk7258_rptun_quiesce(void)
{
  struct bk7258_rptun_dev_s *priv = &g_bk7258_rptun;

  if (!priv->initialized)
    {
      return OK;
    }

#ifdef CONFIG_BK7258_AP_CORE
  return -EPERM;
#else
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  uint32_t flags;
  uint32_t state;

  state = __atomic_load_n((uint32_t *)(uintptr_t)&control->state,
                          __ATOMIC_ACQUIRE);
  flags = __atomic_load_n((uint32_t *)(uintptr_t)&control->flags,
                          __ATOMIC_ACQUIRE);

  /* rptun_initialize()/rptun_boot() complete in a worker.  Killing that
   * worker after remoteproc linked a vdev but before rpmsg_virtio_probe()
   * installed its private data makes rpmsg_virtio_remove() dereference a
   * partial vdev.  Refuse teardown until a Name Service bind proves that the
   * asynchronous probe completed.  This guard also protects callers other
   * than the AP lifecycle wrapper.
   */

  if (state == BK7258_RPTUN_STATE_PREPARING ||
      state == BK7258_RPTUN_STATE_TABLE_READY ||
      state == BK7258_RPTUN_STATE_CONNECTING ||
      (state == BK7258_RPTUN_STATE_FAULTED &&
       (flags & BK7258_RPTUN_FLAG_CONNECTED_ONCE) == 0))
    {
      return -EBUSY;
    }

  return rptun_poweroff(BK7258_RPTUN_REMOTE_NAME);
#endif
}

#endif /* CONFIG_BK7258_RPTUN */
